In [149]:
import pandas as pd # type: ignore

### Ejercicio 1: Carga y Exploración del Dataset ✅

- Carga el dataset en un DataFrame.

In [150]:
df = pd.read_csv('sales.csv')

- Muestra las primeras 2 filas del dataset.

In [151]:
df.head(2)

,Unnamed: 0,fecha,producto,categoria,precio,cantidad,vendedor,ciudad,rating,comentarios
0,0,NaN,Auriculares,ELECTRONICA,672.699356,-5.0,Juan,BARCELONA,0.381071,Malo
1,1,2023-02-05 20:00:00,Monitor,Electrónica,325.415637,10.0,JUAN,Madrid,0.220931,NaN

- Identifica el número de filas y columnas.

In [152]:
df.shape

(100, 10)

- Observa los tipos de datos en cada columna.

In [153]:
df.dtypes

Unnamed: 0       int64
fecha           object
producto        object
categoria       object
precio         float64
cantidad       float64
vendedor        object
ciudad          object
rating         float64
comentarios     object
dtype: object

### Ejercicio 2: Resumen Estadístico ✅

- Obtén un resumen estadístico de las columnas numéricas.

In [154]:
df.describe()

       Unnamed: 0      precio   cantidad     rating
count  100.000000   90.000000  92.000000  97.000000
mean    49.500000  516.470981  21.565217   2.933186
std     29.011492  255.015245  16.100170   1.668733
min      0.000000  104.666376  -5.000000   0.015570
25%     24.750000  325.273578   6.750000   1.612035
50%     49.500000  487.825846  23.000000   3.091416
75%     74.250000  715.744724  33.000000   4.186005
max     99.000000  995.095460  49.000000   5.882776

- Genera un resumen estadístico solo para las columnas categóricas.

In [155]:
df.describe(include='object')

,fecha,producto,categoria,vendedor,ciudad,comentarios
count,95,86,77,88,86,70
unique,95,7,4,9,5,5
top,2023-02-05 20:00:00,laptop,Electrónica,Ana,BARCELONA,
freq,1,16,28,13,22,17

### Ejercicio 3: Manejo de Datos Faltantes ✅

- Cuenta el número de valores faltantes en cada columna.

In [156]:
df.isnull().sum()

Unnamed: 0      0
fecha           5
producto       14
categoria      23
precio         10
cantidad        8
vendedor       12
ciudad         14
rating          3
comentarios    30
dtype: int64

- Rellena los valores faltantes en la columna `cantidad` con la mediana.

In [157]:
median = df['cantidad'].median()
df['cantidad'] = df['cantidad'].fillna(median)
df['cantidad']

0     -5.0
1     10.0
2     33.0
3     -1.0
4     23.0
      ...
95    45.0
96    35.0
97     1.0
98    -2.0
99    47.0
Name: cantidad, Length: 100, dtype: float64

- Elimina las filas con valores nulos en `producto`.

In [158]:
df = df.dropna(subset='producto')
df.head()

,Unnamed: 0,fecha,producto,categoria,precio,cantidad,vendedor,ciudad,rating,comentarios
0,0,NaN,Auriculares,ELECTRONICA,672.699356,-5.0,Juan,BARCELONA,0.381071,Malo
1,1,2023-02-05 20:00:00,Monitor,Electrónica,325.415637,10.0,JUAN,Madrid,0.220931,NaN
2,2,2023-08-13 14:00:00,laptop,Electronca,630.883763,33.0,Janise,Madrid,0.803113,
3,3,2023-08-05 07:00:00,laptop,Electrónica,981.003572,-1.0,Ana,Valencia,0.082032,Bueno
5,5,2023-09-19 01:00:00,laptop,ELECTRONICA,NaN,23.0,Ana,madrid,4.150286,Bueno

### Ejercicio 4: Renombrar Columnas ✅

- Cambia el nombre de `Unnamed: 0` a `id`.

In [159]:
df['id'] = df['Unnamed: 0']
df = df.set_index('id')
df = df.drop(columns=['Unnamed: 0'])
df.head()

,fecha,producto,categoria,precio,cantidad,vendedor,ciudad,rating,comentarios
id,,,,,,,,,
0,NaN,Auriculares,ELECTRONICA,672.699356,-5.0,Juan,BARCELONA,0.381071,Malo
1,2023-02-05 20:00:00,Monitor,Electrónica,325.415637,10.0,JUAN,Madrid,0.220931,NaN
2,2023-08-13 14:00:00,laptop,Electronca,630.883763,33.0,Janise,Madrid,0.803113,
3,2023-08-05 07:00:00,laptop,Electrónica,981.003572,-1.0,Ana,Valencia,0.082032,Bueno
5,2023-09-19 01:00:00,laptop,ELECTRONICA,NaN,23.0,Ana,madrid,4.150286,Bueno

- Haz que todos los nombres de columnas estén en minúsculas.

In [160]:
df = df.rename(lambda x: x.lower(), axis='columns')
df.head(2)

,fecha,producto,categoria,precio,cantidad,vendedor,ciudad,rating,comentarios
id,,,,,,,,,
0,NaN,Auriculares,ELECTRONICA,672.699356,-5.0,Juan,BARCELONA,0.381071,Malo
1,2023-02-05 20:00:00,Monitor,Electrónica,325.415637,10.0,JUAN,Madrid,0.220931,NaN

- Renombra `categoria` a `tipo_producto`.

In [161]:
df = df.rename(columns={ 'categoria': 'tipo_producto' })
df.head(2)

,fecha,producto,tipo_producto,precio,cantidad,vendedor,ciudad,rating,comentarios
id,,,,,,,,,
0,NaN,Auriculares,ELECTRONICA,672.699356,-5.0,Juan,BARCELONA,0.381071,Malo
1,2023-02-05 20:00:00,Monitor,Electrónica,325.415637,10.0,JUAN,Madrid,0.220931,NaN